import MyRecommend1 from 'template/img/bg/MyRecommend-1.png';
import MyRecommend2 from 'template/img/bg/MyRecommend-2.png';
import MyRecommend3 from 'template/img/bg/MyRecommend-3.png';

export const myRecordData = {
    list1: [
        {
            name: 'BODY RECORD',
            path: '#',
            imgPath: MyRecommend1,
            title: '自分のカラダの記録',
        },
        {
            name: 'MY EXERCISE',
            path: '#',
            imgPath: MyRecommend2,
            title: '自分の運動の記録',
        },
        {
            name: 'MY DIARY',
            path: '#',
            imgPath: MyRecommend3,
            title: '自分の日記',
        },
    ],
    list2: {
        title: 'BODY RECORD',
        createDate: '2021.05.21',
        time: ['日', '週', '月', '年'],
    },
    titleList3: {
        title: 'MY EXERCISE',
        createDate: '2021.05.21',
    },
    list3: [
        {
            title: '家事全般（立位・軽い）',
            duration: '10 min',
            kcal: 26,
        },
        {
            title: '家事全般（立位・軽い）',
            duration: '10 min',
            kcal: 26,
        },
        {
            title: '家事全般（立位・軽い）',
            duration: '10 min',
            kcal: 26,
        },
        {
            title: '家事全般（立位・軽い）',
            duration: '10 min',
            kcal: 26,
        },
        {
            title: '家事全般（立位・軽い）',
            duration: '10 min',
            kcal: 26,
        },
        {
            title: '家事全般（立位・軽い）',
            duration: '10 min',
            kcal: 26,
        },
        {
            title: '家事全般（立位・軽い）',
            duration: '10 min',
            kcal: 26,
        },
        {
            title: '家事全般（立位・軽い）',
            duration: '10 min',
            kcal: 26,
        },
        {
            title: '家事全般（立位・軽い）',
            duration: '10 min',
            kcal: 26,
        },
        {
            title: '家事全般（立位・軽い）',
            duration: '10 min',
            kcal: 26,
        },
        {
            title: '家事全般（立位・軽い）',
            duration: '10 min',
            kcal: 26,
        },
        {
            title: '家事全般（立位・軽い）',
            duration: '10 min',
            kcal: 26,
        },
        {
            title: '家事全般（立位・軽い）',
            duration: '10 min',
            kcal: 26,
        },
        {
            title: '家事全般（立位・軽い）',
            duration: '10 min',
            kcal: 26,
        },
        {
            title: '家事全般（立位・軽い）',
            duration: '10 min',
            kcal: 26,
        },
        {
            title: '家事全般（立位・軽い）',
            duration: '10 min',
            kcal: 26,
        },
    ],
    list4: {
        title: '自分の日記',
        data: [
            {
                createDate: '2021.05.21',
                time: '23:25',
                title: '私の日記の記録が一部表示されます。',
                content:
                    'テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト…',
            },
            {
                createDate: '2021.05.21 23:25',
                time: '23:25',
                title: '私の日記の記録が一部表示されます。',
                content:
                    'テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト…',
            },
            {
                createDate: '2021.05.21',
                time: '23:25',
                title: '私の日記の記録が一部表示されます。',
                content:
                    'テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト…',
            },
            {
                createDate: '2021.05.21',
                time: '23:25',
                title: '私の日記の記録が一部表示されます。',
                content:
                    'テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト…',
            },
            {
                createDate: '2021.05.21',
                time: '23:25',
                title: '私の日記の記録が一部表示されます。',
                content:
                    'テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト…',
            },
            {
                createDate: '2021.05.21',
                time: '23:25',
                title: '私の日記の記録が一部表示されます。',
                content:
                    'テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト…',
            },
            {
                createDate: '2021.05.21 23:25',
                time: '23:25',
                title: '私の日記の記録が一部表示されます。',
                content:
                    'テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト…',
            },
            {
                createDate: '2021.05.21 23:25',
                time: '23:25',
                title: '私の日記の記録が一部表示されます。',
                content:
                    'テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト…',
            },
            {
                createDate: '2021.05.21',
                time: '23:25',
                title: '私の日記の記録が一部表示されます。',
                content:
                    'テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト…',
            },
            {
                createDate: '2021.05.21 23:25',
                time: '23:25',
                title: '私の日記の記録が一部表示されます。',
                content:
                    'テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト…',
            },
            {
                createDate: '2021.05.21',
                time: '23:25',
                title: '私の日記の記録が一部表示されます。',
                content:
                    'テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト…',
            },
            {
                createDate: '2021.05.21',
                time: '23:25',
                title: '私の日記の記録が一部表示されます。',
                content:
                    'テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト…',
            },
            {
                createDate: '2021.05.21',
                time: '23:25',
                title: '私の日記の記録が一部表示されます。',
                content:
                    'テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト…',
            },
            {
                createDate: '2021.05.21',
                time: '23:25',
                title: '私の日記の記録が一部表示されます。',
                content:
                    'テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト…',
            },
            {
                createDate: '2021.05.21 23:25',
                time: '23:25',
                title: '私の日記の記録が一部表示されます。',
                content:
                    'テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト…',
            },
            {
                createDate: '2021.05.21 23:25',
                time: '23:25',
                title: '私の日記の記録が一部表示されます。',
                content:
                    'テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト…',
            },
            {
                createDate: '2021.05.21',
                time: '23:25',
                title: '私の日記の記録が一部表示されます。',
                content:
                    'テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト…',
            },
            {
                createDate: '2021.05.21 23:25',
                time: '23:25',
                title: '私の日記の記録が一部表示されます。',
                content:
                    'テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト…',
            },
            {
                createDate: '2021.05.21',
                time: '23:25',
                title: '私の日記の記録が一部表示されます。',
                content:
                    'テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト…',
            },
            {
                createDate: '2021.05.21',
                time: '23:25',
                title: '私の日記の記録が一部表示されます。',
                content:
                    'テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト…',
            },
            {
                createDate: '2021.05.21',
                time: '23:25',
                title: '私の日記の記録が一部表示されます。',
                content:
                    'テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト…',
            },
            {
                createDate: '2021.05.21',
                time: '23:25',
                title: '私の日記の記録が一部表示されます。',
                content:
                    'テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト…',
            },
            {
                createDate: '2021.05.21 23:25',
                time: '23:25',
                title: '私の日記の記録が一部表示されます。',
                content:
                    'テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト…',
            },
            {
                createDate: '2021.05.21 23:25',
                time: '23:25',
                title: '私の日記の記録が一部表示されます。',
                content:
                    'テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト…',
            },
        ],
    },
};
